htdocs/olivia/app/Http/Controllers/DashboardController.php

SELECT * FROM `kupons`
---
    public function view(){
        return view('dashboard/index',[
            'kupon' => Kupon::all()
        ]);

UPDATE `users` SET `name` = 'Riri Riri', `email` = 'riri@gmail.com', `no_hp` = '081378654700', `alamat` = 'Jl. Sutejo' WHERE `id` = '19'
SELECT * FROM `users` WHERE `id` = '19' LIMIT 1
---
    public function ubahData(Request $request)
    {
        $dataValid = DB::table('users')->where('id',auth()->user()->id)->update([
            'name' => $request->name,
            'email' => $request->email,
            'no_hp' => $request->no_hp,
            'alamat' => $request->alamat
        ]);