htdocs/olivia/app/Http/Controllers/DashboardArtikelController.php

SELECT * FROM `artikels` ORDER BY `created_at` DESC LIMIT 15 offset 0
SELECT count(*) as aggregate FROM `artikels`
---
    public function index()
    {
        return view('/dashboard/artikel/index',[
            'artikel' => Artikel::latest()->paginate(15)->withQueryString()
        ]);

SELECT * FROM `categories`
---
    public function edit(Artikel $artikel)
    {
        return view('/dashboard/artikel/edit', [
            'artikel' => $artikel,
            'categories' => Category::all()