htdocs/olivia/app/Http/Controllers/FormController.php

    public function send(Request $request){

        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'email' => 'required|email:dns',
            'deskripsi' => 'required|min:5|max:255'
        ]);

        $validatedData['id'] = Form::latest('id')->get()[0]->id + 1;

        Form::create($validatedData);
---
SELECT * FROM `forms` ORDER BY `id` DESC
INSERT INTO `forms` (`name`, `email`, `deskripsi`, `id`, `updated_at`, `created_at`) VALUES ('Aurhiel Chatlea Sabrine', 'aurhielsabrine@gmail.com', 'gfftftru', '9', '2021-11-10 16:35:03', '2021-11-10 16:35:03')