htdocs/olivia/app/Http/Controllers/RegisterController.php

SELECT * FROM `users` ORDER BY `id` DESC
INSERT INTO `users` (`name`, `email`, `password`, `role_id`, `poin_id`, `id`, `updated_at`, `created_at`) VALUES ('nurul', 'nurulchoir@gmail.com', 'y'1'XY6IiTFByZxVpINUp5jc.dS0fO3himFx4ggs3xq0IViTzcXrUDYa', '24', '24', '2021-11-11 04:01:54', '2021-11-11 04:01:54', ?)
INSERT INTO `jumlah_poins` (`id`, `user_id`, `poin`, `updated_at`, `created_at`) VALUES ('26', '26', '0', '2021-11-17 11:01:12', '2021-11-17 11:01:12')
---
    public function store(Request $request){

        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'email' => 'required|email:dns|unique:users',
            'password' => 'required|min:5|max:255',
        ]);

        $validatedData['password'] = Hash::make($validatedData['password']);
        $validatedData['role_id'] = 1;
        $userIdNext = User::latest('id')->get();
        $validatedData['poin_id'] = $userIdNext[0]->id + 1;
        $validatedData['id'] = $validatedData['poin_id'];
        User::create($validatedData);
        JumlahPoin::create([
            'id' => $validatedData['poin_id'],
            'user_id' => $validatedData['poin_id'],
            'poin' => 0
        ]);