htdocs/olivia/app/Http/Controllers/SetorController.php

SELECT * FROM `jenis_sampahs`
SELECT * FROM `kolegas`
---
    public function setor(){
        return view('setor2',[
            'title' => 'Mulai Setor',
            'jenis_sampah' => JenisSampah::all(),
            'kolega' => Kolega::all()
        ]);

UPDATE `jumlah_poins` SET `poin` = '100' WHERE `user_id` = '18'
INSERT INTO `riwayat_antars` (`user_id`, `jenis_sampah_id`, `berat`, `alamat`, `alamat_pengiriman`, `deskripsi_alamat`, `updated_at`, `created_at`) VALUES ('18', '4', '3 kg', 'Ds. Uluwatu No. 286, Jayapura 80720, Sulsel', 'desa bibrik', 'fgvv', '2021-11-14 10:53:18', '2021-11-14 10:53:18')
---
    public function kirimSetor(Request $request){
        $user_id = auth()->user()->id;
        if(empty($request->jenis_sampah_id)){
            return redirect('/layanan/setor-barang')->with('kosong', 'pilih jenis sampah!');
        }
        $jenis_sampah_id = $request->jenis_sampah_id;
        $berat = $request->berat;
        $alamat = $request->alamat;
        $alamat_pengiriman = $request->alamat_pengiriman;
        $deskripsi_alamat = $request->deskripsi_alamat;
        $poinSekarang = auth()->user()->poin->poin;
        $poinSekarang += 50;
        $updatePoin = DB::table('jumlah_poins')->where('user_id',auth()->user()->id)->update([
            'poin' => $poinSekarang
        ]);
        if ($berat < 0) {
            dd($berat);
            return redirect('/layanan/setor-barang');
        }
        RiwayatAntar::create([
            'user_id' => $user_id,
            'jenis_sampah_id' => $jenis_sampah_id,
            'berat' => $berat,
            'alamat' => $alamat,
            'alamat_pengiriman' => $alamat_pengiriman,
            'deskripsi_alamat' => $deskripsi_alamat
        ]);